source
    | project
    TimeGenerated =  TimeGenerated,
    AdditionalFields =  todynamic(AdditionalFields),
    EventMessage =  EventMessage,
    EventCount =  toint(EventCount),
    EventStartTime =  todatetime(EventStartTime),
    EventEndTime =  todatetime(EventEndTime),
    EventType =  EventType,
    EventSubType =  EventSubType,
    EventResult =  EventResult,
    EventResultDetails =  EventResultDetails,
    EventOriginalUid =  EventOriginalUid,
    EventOriginalType =  EventOriginalType,
    EventOriginalSubType =  EventOriginalSubType,
    EventOriginalResultDetails =  EventOriginalResultDetails,
    EventSeverity =  EventSeverity,
    EventOriginalSeverity =  EventOriginalSeverity,
    EventProduct =  EventProduct,
    EventProductVersion =  EventProductVersion,
    EventVendor =  EventVendor,
    EventSchemaVersion =  EventSchemaVersion,
    EventOwner =  EventOwner,
    EventReportUrl =  EventReportUrl,
    DvcIpAddr =  DvcIpAddr,
    DvcHostname =  DvcHostname,
    DvcDomain =  DvcDomain,
    DvcDomainType =  DvcDomainType,
    DvcFQDN =  DvcFQDN,
    DvcDescription =  DvcDescription,
    DvcId =  DvcId,
    DvcIdType =  DvcIdType,
    DvcMacAddr =  DvcMacAddr,
    DvcZone =  DvcZone,
    DvcOs =  DvcOs,
    DvcOsVersion =  DvcOsVersion,
    DvcAction =  DvcAction,
    DvcOriginalAction =  DvcOriginalAction,
    DvcInterface =  DvcInterface,
    DvcScopeId =  DvcScopeId,
    DvcScope =  DvcScope,
    ActorUserId =  ActorUserId,
    ActorUserAadId = ActorUserAadId,
    ActorUserSid = ActorUserSid,
    ActorUserIdType =  ActorUserIdType,
    ActorScopeId =  ActorScopeId,
    ActorScope =  ActorScope,
    ActorUsername =  ActorUsername,
    ActorUsernameType =  ActorUsernameType,
    ActorUserType =  ActorUserType,
    ActorOriginalUserType =  ActorOriginalUserType,
    ActorSessionId =  ActorSessionId,
    TargetUserId =  TargetUserId,
    TargetUserUid = TargetUserUid,
    TargetUserIdType =  TargetUserIdType,
    TargetUsername =  TargetUsername,
    TargetUsernameType =  TargetUsernameType,
    TargetUserType =  TargetUserType,
    TargetUserSessionId = TargetUserSessionId,
    TargetOriginalUserType =  TargetOriginalUserType,
    TargetUserScope = TargetUserScope,
    TargetUserScopeId = TargetUserScopeId,
    GroupId =  GroupId,
    GroupIdType =  GroupIdType,
    GroupName =  GroupName,
    GroupNameType =  GroupNameType,
    GroupType =  GroupType,
    GroupOriginalType =  GroupOriginalType,
    SrcIpAddr =  SrcIpAddr,
    SrcPortNumber =  toint(SrcPortNumber),
    SrcHostname =  SrcHostname,
    SrcMacAddr =  SrcMacAddr,
    SrcDomain =  SrcDomain,
    SrcDomainType = SrcDomainType,
    SrcFQDN =  SrcFQDN,
    SrcDescription =  SrcDescription,
    SrcDvcId =  SrcDvcId,
    SrcDvcIdType =  SrcDvcIdType,
    SrcDvcScopeId =  SrcDvcScopeId,
    SrcDvcScope =  SrcDvcScope,
    SrcDeviceType =  SrcDeviceType,
    SrcGeoCountry =  SrcGeoCountry,
    SrcGeoLatitude =  todouble(SrcGeoLatitude),
    SrcGeoLongitude =  todouble(SrcGeoLongitude),
    SrcGeoRegion =  SrcGeoRegion,
    SrcGeoCity =  SrcGeoCity,
    SrcRiskLevel =  toint(SrcRiskLevel),
    SrcOriginalRiskLevel =  SrcOriginalRiskLevel,
    ActingAppId =  ActingAppId,
    ActingAppName =  ActingAppName,
    ActingAppType =  ActingAppType,
    ActingOriginalAppType = ActingOriginalAppType,
    HttpUserAgent =  HttpUserAgent,
    PreviousPropertyValue =  PreviousPropertyValue,
    NewPropertyValue =  NewPropertyValue,
    EventSchema = EventSchema,
    RuleName = RuleName,
	RuleNumber = toint(RuleNumber),
	ThreatId = ThreatId,
	ThreatName = ThreatName,
	ThreatCategory = ThreatCategory,
	ThreatRiskLevel = toint(ThreatRiskLevel),
	ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
	ThreatField = ThreatField,
	ThreatConfidence = toint(ThreatConfidence),
	ThreatOriginalConfidence = ThreatOriginalConfidence,
	ThreatIsActive = tobool(ThreatIsActive),
	ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
	ThreatLastReportedTime = todatetime(ThreatLastReportedTime)