source
| project
        TimeGenerated = todatetime(TimeGenerated),
        AdditionalFields = todynamic(AdditionalFields),
        EventMessage = EventMessage,
        EventCount = toint(EventCount),
        EventStartTime = todatetime(EventStartTime),
        EventEndTime = todatetime(EventEndTime),
        EventType = EventType,
        EventSubType = EventSubType,
        EventResult = EventResult,
        EventResultDetails = EventResultDetails,
        EventOriginalUid = EventOriginalUid,
        EventOriginalType = EventOriginalType,
        EventOriginalSubType = EventOriginalSubType,
        EventOriginalResultDetails = EventOriginalResultDetails,
        EventSeverity = EventSeverity,
        EventOriginalSeverity = EventOriginalSeverity,
        EventProduct = EventProduct,
        EventProductVersion = EventProductVersion,
        EventVendor = EventVendor,
        EventSchemaVersion = EventSchemaVersion,
        EventOwner = EventOwner,
        EventReportUrl = EventReportUrl,
        RuleName = RuleName,
        RuleNumber = toint(RuleNumber),
        ThreatId = ThreatId,
        ThreatName = ThreatName,
        ThreatCategory = ThreatCategory,
        ThreatRiskLevel = toint(ThreatRiskLevel),
        ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
        ThreatConfidence = toint(ThreatConfidence),
        ThreatOriginalConfidence = ThreatOriginalConfidence,
        ThreatIsActive = tobool(ThreatIsActive),
        ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
        ThreatLastReportedTime = todatetime(ThreatLastReportedTime),
        ThreatField = ThreatField,
        ThreatIpAddr = ThreatIpAddr,
        DvcIpAddr = DvcIpAddr,
        DvcHostname = DvcHostname,
        DvcDomain = DvcDomain,
        DvcDomainType = DvcDomainType,
        DvcFQDN = DvcFQDN,
        DvcDescription = DvcDescription,
        DvcId = DvcId,
        DvcIdType = DvcIdType,
        DvcMacAddr = DvcMacAddr,
        DvcZone = DvcZone,
        DvcOs = DvcOs,
        DvcOsVersion = DvcOsVersion,
        DvcAction = DvcAction,
        DvcOriginalAction = DvcOriginalAction,
        DvcInterface = DvcInterface,
        DvcScopeId = DvcScopeId,
        DvcScope = DvcScope,
        ActorUserId = ActorUserId,
        ActorUserIdType = ActorUserIdType,
        ActorScopeId = ActorScopeId,
        ActorScope = ActorScope,
        ActorUsername = ActorUsername,
        ActorUsernameType = ActorUsernameType,
        ActorUserType = ActorUserType,
        ActorOriginalUserType = ActorOriginalUserType,
        ActorSessionId = ActorSessionId,
        ActingAppId = ActingAppId,
        ActingAppName = ActingAppName,
        ActingAppType = ActingAppType,
        ActingOriginalAppType = ActingOriginalAppType,
        HttpUserAgent = HttpUserAgent,
        TargetUserId = TargetUserId,
        TargetUserIdType = TargetUserIdType,
        TargetUserScopeId = TargetUserScopeId,
        TargetUserScope = TargetUserScope,
        TargetUsername = TargetUsername,
        TargetUsernameType = TargetUsernameType,
        TargetUserType = TargetUserType,
        TargetOriginalUserType = TargetOriginalUserType,
        TargetSessionId = TargetSessionId,
        TargetAppId = TargetAppId,
        TargetAppName = TargetAppName,
        TargetAppType = TargetAppType,
        TargetOriginalAppType = TargetOriginalAppType,
        TargetUrl = TargetUrl,
        SrcIpAddr = SrcIpAddr,
        SrcPortNumber = toint(SrcPortNumber),
        SrcHostname = SrcHostname,
        SrcDomain = SrcDomain,
        SrcDomainType = SrcDomainType,
        SrcFQDN = SrcFQDN,
        SrcDescription = SrcDescription,
        SrcDvcId = SrcDvcId,
        SrcDvcIdType = SrcDvcIdType,
        SrcDvcScopeId = SrcDvcScopeId,
        SrcDvcScope = SrcDvcScope,
        SrcDeviceType = SrcDeviceType,
        SrcGeoCountry = SrcGeoCountry,
        SrcGeoLatitude = todouble(SrcGeoLatitude),
        SrcGeoLongitude = todouble(SrcGeoLongitude),
        SrcGeoRegion = SrcGeoRegion,
        SrcGeoCity = SrcGeoCity,
        SrcRiskLevel = toint(SrcRiskLevel),
        SrcOriginalRiskLevel = SrcOriginalRiskLevel,
        SrcIsp = SrcIsp,
        SrcDvcOs = SrcDvcOs,
        TargetIpAddr = TargetIpAddr,
        TargetPortNumber = toint(TargetPortNumber),
        TargetHostname = TargetHostname,
        TargetDomain = TargetDomain,
        TargetDomainType = TargetDomainType,
        TargetFQDN = TargetFQDN,
        TargetDescription = TargetDescription,
        TargetDvcId = TargetDvcId,
        TargetDvcIdType = TargetDvcIdType,
        TargetDvcScopeId = TargetDvcScopeId,
        TargetDvcScope = TargetDvcScope,
        TargetDeviceType = TargetDeviceType,
        TargetGeoCountry = TargetGeoCountry,
        TargetGeoLatitude = todouble(TargetGeoLatitude),
        TargetGeoLongitude = todouble(TargetGeoLongitude),
        TargetGeoRegion = TargetGeoRegion,
        TargetGeoCity = TargetGeoCity,
        TargetRiskLevel = toint(TargetRiskLevel),
        TargetOriginalRiskLevel = TargetOriginalRiskLevel,
        TargetDvcOs = TargetDvcOs,
        LogonMethod = LogonMethod,
        LogonProtocol = LogonProtocol