source
| project
        TimeGenerated = TimeGenerated,
        AdditionalFields = todynamic(AdditionalFields),
        EventMessage = EventMessage,
        EventCount = toint(EventCount),
        EventStartTime = todatetime(EventStartTime),
        EventEndTime = todatetime(EventEndTime),
        EventType = EventType,
        EventSubType = EventSubType,
        EventResult = EventResult,
        EventResultDetails = EventResultDetails,
        EventOriginalUid = EventOriginalUid,
        EventOriginalType = EventOriginalType,
        EventOriginalSubType = EventOriginalSubType,
        EventOriginalResultDetails = EventOriginalResultDetails,
        EventSeverity = EventSeverity,
        EventOriginalSeverity = EventOriginalSeverity,
        EventProduct = EventProduct,
        EventProductVersion = EventProductVersion,
        EventVendor = EventVendor,
        EventSchemaVersion = EventSchemaVersion,
        EventOwner = EventOwner,
        EventReportUrl = EventReportUrl,
        DvcIpAddr = DvcIpAddr,
        DvcHostname = DvcHostname,
        DvcDomain = DvcDomain,
        DvcDomainType = DvcDomainType,
        DvcFQDN = DvcFQDN,
        DvcDescription = DvcDescription,
        DvcId = DvcId,
        DvcIdType = DvcIdType,
        DvcMacAddr = DvcMacAddr,
        DvcZone = DvcZone,
        DvcOs = DvcOs,
        DvcOsVersion = DvcOsVersion,
        DvcAction = DvcAction,
        DvcOriginalAction = DvcOriginalAction,
        DvcInterface = DvcInterface,
        DvcScopeId = DvcScopeId,
        DvcScope = DvcScope,
        ActorUserId = ActorUserId,
        ActorUserIdType = ActorUserIdType,
        ActorScopeId = ActorScopeId,
        ActorScope = ActorScope,
        ActorUsername = ActorUsername,
        ActorUsernameType = ActorUsernameType,
        ActorUserType = ActorUserType,
        ActorOriginalUserType = ActorOriginalUserType,
        ActorSessionId = ActorSessionId,
        TargetUserId = TargetUserId,
        TargetUserIdType = TargetUserIdType,
        TargetScopeId = TargetScopeId,
        TargetScope = TargetScope,
        TargetUsername = TargetUsername,
        TargetUsernameType = TargetUsernameType,
        TargetUserType = TargetUserType,
        TargetOriginalUserType = TargetOriginalUserType,
        TargetUserSessionId = TargetUserSessionId,
        TargetUserSessionGuid = TargetUserSessionGuid,
        ActingProcessCommandLine = ActingProcessCommandLine,
        ActingProcessName = ActingProcessName,
        ActingProcessFileCompany = ActingProcessFileCompany,
        ActingProcessFileDescription = ActingProcessFileDescription,
        ActingProcessFileProduct = ActingProcessFileProduct,
        ActingProcessFileVersion = ActingProcessFileVersion,
        ActingProcessFileInternalName = ActingProcessFileInternalName,
        ActingProcessFileOriginalName = ActingProcessFileOriginalName,
        ActingProcessFilename = ActingProcessFilename,
        ActingProcessIsHidden = tobool(ActingProcessIsHidden),
        ActingProcessInjectedAddress = ActingProcessInjectedAddress,
        ActingProcessId = ActingProcessId,
        ActingProcessGuid = ActingProcessGuid,
        ActingProcessIntegrityLevel = ActingProcessIntegrityLevel,
        ActingProcessMD5 = ActingProcessMD5,
        ActingProcessSHA1 = ActingProcessSHA1,
        ActingProcessSHA256 = ActingProcessSHA256,
        ActingProcessSHA512 = ActingProcessSHA512,
        ActingProcessIMPHASH = ActingProcessIMPHASH,
        ActingProcessCreationTime = todatetime(ActingProcessCreationTime),
        ActingProcessTokenElevation = ActingProcessTokenElevation,
        ActingProcessFileSize = ActingProcessFileSize,
        ParentProcessName = ParentProcessName,
        ParentProcessFileCompany = ParentProcessFileCompany,
        ParentProcessFileDescription = ParentProcessFileDescription,
        ParentProcessFileProduct = ParentProcessFileProduct,
        ParentProcessFileVersion = ParentProcessFileVersion,
        ParentProcessIsHidden = tobool(ParentProcessIsHidden),
        ParentProcessInjectedAddress = ParentProcessInjectedAddress,
        ParentProcessId = ParentProcessId,
        ParentProcessGuid = ParentProcessGuid,
        ParentProcessIntegrityLevel = ParentProcessIntegrityLevel,
        ParentProcessMD5 = ParentProcessMD5,
        ParentProcessSHA1 = ParentProcessSHA1,
        ParentProcessSHA256 = ParentProcessSHA256,
        ParentProcessSHA512 = ParentProcessSHA512,
        ParentProcessIMPHASH = ParentProcessIMPHASH,
        ParentProcessCreationTime = todatetime(ParentProcessCreationTime),
        ParentProcessTokenElevation = ParentProcessTokenElevation,
        TargetProcessCommandLine = TargetProcessCommandLine,
        TargetProcessName = TargetProcessName,
        TargetProcessFileCompany = TargetProcessFileCompany,
        TargetProcessFileDescription = TargetProcessFileDescription,
        TargetProcessFileProduct = TargetProcessFileProduct,
        TargetProcessFileVersion = TargetProcessFileVersion,
        TargetProcessFileInternalName = TargetProcessFileInternalName,
        TargetProcessFileOriginalName = TargetProcessFileOriginalName,
        TargetProcessFilename = TargetProcessFilename,
        TargetProcessIsHidden = tobool(TargetProcessIsHidden),
        TargetProcessInjectedAddress = TargetProcessInjectedAddress,
        TargetProcessId = TargetProcessId,
        TargetProcessGuid = TargetProcessGuid,
        TargetProcessIntegrityLevel = TargetProcessIntegrityLevel,
        TargetProcessMD5 = TargetProcessMD5,
        TargetProcessSHA1 = TargetProcessSHA1,
        TargetProcessSHA256 = TargetProcessSHA256,
        TargetProcessSHA512 = TargetProcessSHA512,
        TargetProcessIMPHASH = TargetProcessIMPHASH,
        TargetProcessCreationTime = todatetime(TargetProcessCreationTime),
        TargetProcessTokenElevation = TargetProcessTokenElevation,
        TargetProcessFileSize = TargetProcessFileSize,
        TargetProcessCurrentDirectory = TargetProcessCurrentDirectory,
        TargetProcessStatusCode = TargetProcessStatusCode,
        RuleName = RuleName,
	RuleNumber = toint(RuleNumber),
	ThreatId = ThreatId,
	ThreatName = ThreatName,
	ThreatCategory = ThreatCategory,
	ThreatRiskLevel = toint(ThreatRiskLevel),
	ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
	ThreatField = ThreatField,
	ThreatConfidence = toint(ThreatConfidence),
	ThreatOriginalConfidence = ThreatOriginalConfidence,
	ThreatIsActive = tobool(ThreatIsActive),
	ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
	ThreatLastReportedTime = todatetime(ThreatLastReportedTime)