source
| project
    TimeGenerated = TimeGenerated,
    AdditionalFields = todynamic(AdditionalFields),
    EventMessage = EventMessage,
    EventCount = toint(EventCount),
    EventStartTime = todatetime(EventStartTime),
    EventEndTime = todatetime(EventEndTime),
    EventType = EventType,
    EventSubType = EventSubType,
    EventResult = EventResult,
    EventResultDetails = EventResultDetails,
    EventOriginalUid = EventOriginalUid,
    EventOriginalType = EventOriginalType,
    EventOriginalSubType = EventOriginalSubType,
    EventOriginalResultDetails = EventOriginalResultDetails,
    EventSeverity = EventSeverity,
    EventOriginalSeverity = EventOriginalSeverity,
    EventProduct = EventProduct,
    EventProductVersion = EventProductVersion,
    EventVendor = EventVendor,
    EventSchemaVersion = EventSchemaVersion,
    EventOwner = EventOwner,
    EventReportUrl = EventReportUrl,
    RuleName = RuleName,
    RuleNumber = toint(RuleNumber),
    ThreatId = ThreatId,
    ThreatIpAddr = ThreatIpAddr,
    ThreatName = ThreatName,
    ThreatCategory = ThreatCategory,
    ThreatRiskLevel = toint(ThreatRiskLevel),
    ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
    ThreatConfidence = toint(ThreatConfidence),
    ThreatOriginalConfidence = ThreatOriginalConfidence,
    ThreatIsActive = tobool(ThreatIsActive),
    ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
    ThreatLastReportedTime = todatetime(ThreatLastReportedTime),
    ThreatField = ThreatField,
    DvcIpAddr = DvcIpAddr,
    DvcHostname = DvcHostname,
    DvcDomain = DvcDomain,
    DvcDomainType = DvcDomainType,
    DvcFQDN = DvcFQDN,
    DvcDescription = DvcDescription,
    DvcId = DvcId,
    DvcIdType = DvcIdType,
    DvcMacAddr = DvcMacAddr,
    DvcZone = DvcZone,
    DvcOs = DvcOs,
    DvcOsVersion = DvcOsVersion,
    DvcAction = DvcAction,
    DvcOriginalAction = DvcOriginalAction,
    DvcInterface = DvcInterface,
    DvcScopeId = DvcScopeId,
    DvcScope = DvcScope,
    ActorUserId = ActorUserId,
    ActorUserAadId = ActorUserAadId,
    ActorUserSid = ActorUserSid,
    ActorUserIdType = ActorUserIdType,
    ActorScopeId = ActorScopeId,
    ActorScope = ActorScope,
    ActorUsername = ActorUsername,
    ActorUsernameType = ActorUsernameType,
    ActorUserType = ActorUserType,
    ActorOriginalUserType = ActorOriginalUserType,
    ActorSessionId = ActorSessionId,
    TargetAppId = TargetAppId,
    TargetAppName = TargetAppName,
    TargetAppType = TargetAppType,
    TargetOriginalAppType = TargetOriginalAppType,
    TargetUrl = TargetUrl,
    ActingAppId = ActingAppId,
    ActingAppName = ActingAppName,
    ActingAppType = ActingAppType,
    ActingOriginalAppType = ActingOriginalAppType,
    HttpUserAgent = HttpUserAgent,
    SrcIpAddr = SrcIpAddr,
    SrcPortNumber = toint(SrcPortNumber),
    SrcHostname = SrcHostname,
    SrcDomain = SrcDomain,
    SrcDomainType = SrcDomainType,
    SrcFQDN = SrcFQDN,
    SrcDescription = SrcDescription,
    SrcDvcId = SrcDvcId,
    SrcDvcIdType = SrcDvcIdType,
    SrcDvcScopeId = SrcDvcScopeId,
    SrcDvcScope = SrcDvcScope,
    SrcDeviceType = SrcDeviceType,
    SrcGeoCountry = SrcGeoCountry,
    SrcGeoLatitude = todouble(SrcGeoLatitude),
    SrcGeoLongitude = todouble(SrcGeoLongitude),
    SrcGeoRegion = SrcGeoRegion,
    SrcGeoCity = SrcGeoCity,
    SrcRiskLevel = toint(SrcRiskLevel),
    SrcOriginalRiskLevel = SrcOriginalRiskLevel,
    TargetIpAddr = TargetIpAddr,
    TargetPortNumber = toint(TargetPortNumber),
    TargetHostname = TargetHostname,
    TargetDomain = TargetDomain,
    TargetDomainType = TargetDomainType,
    TargetFQDN = TargetFQDN,
    TargetDescription = TargetDescription,
    TargetDvcId = TargetDvcId,
    TargetDvcIdType = TargetDvcIdType,
    TargetDvcScopeId = TargetDvcScopeId,
    TargetDvcScope = TargetDvcScope,
    TargetDeviceType = TargetDeviceType,
    TargetGeoCountry = TargetGeoCountry,
    TargetGeoLatitude = todouble(TargetGeoLatitude),
    TargetGeoLongitude = todouble(TargetGeoLongitude),
    TargetGeoRegion = TargetGeoRegion,
    TargetGeoCity = TargetGeoCity,
    TargetRiskLevel = toint(TargetRiskLevel),
    TargetOriginalRiskLevel = TargetOriginalRiskLevel,
    TargetDvcOs = TargetDvcOs,
    Operation = Operation,
    ObjectId = ObjectId,
    Object = Object,
    ObjectType = ObjectType,
    OriginalObjectType = OriginalObjectType,
    OldValue = OldValue,
    NewValue = NewValue,
    ValueType = ValueType