source
    | project
    TimeGenerated =  TimeGenerated,
    AdditionalFields =  todynamic(AdditionalFields),
    EventMessage =  EventMessage,
    EventCount =  toint(EventCount),
    EventStartTime =  todatetime(EventStartTime),
    EventEndTime =  todatetime(EventEndTime),
    EventType =  EventType,
    EventSubType =  EventSubType,
    EventResult =  EventResult,
    EventResultDetails =  EventResultDetails,
    EventOriginalUid =  EventOriginalUid,
    EventOriginalType =  EventOriginalType,
    EventOriginalSubType =  EventOriginalSubType,
    EventOriginalResultDetails =  EventOriginalResultDetails,
    EventSeverity =  EventSeverity,
    EventOriginalSeverity =  EventOriginalSeverity,
    EventProduct =  EventProduct,
    EventProductVersion =  EventProductVersion,
    EventVendor =  EventVendor,
    ParentProcessCommandLine = ParentProcessCommandLine,
    EventSchemaVersion =  EventSchemaVersion,
    EventOwner =  EventOwner,
    EventReportUrl =  EventReportUrl,
    DvcIpAddr =  DvcIpAddr,
    DvcHostname =  DvcHostname,
    DvcDomain =  DvcDomain,
    DvcDomainType = DvcDomainType,
    DvcFQDN =  DvcFQDN,
    DvcDescription =  DvcDescription,
    DvcId =  DvcId,
    DvcIdType = DvcIdType,
    DvcMacAddr =  DvcMacAddr,
    DvcZone =  DvcZone,
    DvcOs =  DvcOs,
    DvcOsVersion =  DvcOsVersion,
    DvcAction =  DvcAction,
    DvcOriginalAction =  DvcOriginalAction,
    DvcInterface =  DvcInterface,
    DvcScopeId =  DvcScopeId,
    DvcScope =  DvcScope,
    ActorUserId =  ActorUserId,
    ActorUserAadId = ActorUserAadId,
    ActorUserSid = ActorUserSid,
    ActorUserIdType =  ActorUserIdType,
    ActorScopeId =  ActorScopeId,
    ActorScope =  ActorScope,
    ActorUsername =  ActorUsername,
    ActorUsernameType =  ActorUsernameType,
    ActorUserType = ActorUserType,
    ActorOriginalUserType = ActorOriginalUserType,
    ActorSessionId =  ActorSessionId,
    ActingProcessName =  ActingProcessName,
    ActingProcessId =  ActingProcessId,
    ActingProcessCommandLine = ActingProcessCommandLine,
    ActingProcessGuid =  ActingProcessGuid,
    ParentProcessName =  ParentProcessName,
    ParentProcessId =  ParentProcessId,
    ParentProcessGuid =  ParentProcessGuid,
    RegistryKey =  RegistryKey,
    RegistryValue =  RegistryValue,
    RegistryValueType =  RegistryValueType,
    RegistryValueData =  RegistryValueData,
    RegistryPreviousKey =  RegistryPreviousKey,
    RegistryPreviousValue =  RegistryPreviousValue,
    RegistryPreviousValueType =  RegistryPreviousValueType,
    RegistryPreviousValueData =  RegistryPreviousValueData,
    EventSchema = EventSchema,
    RuleName = RuleName,
	RuleNumber = toint(RuleNumber),
	ThreatId = ThreatId,
	ThreatName = ThreatName,
	ThreatCategory = ThreatCategory,
	ThreatRiskLevel = toint(ThreatRiskLevel),
	ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
	ThreatField = ThreatField,
	ThreatConfidence = toint(ThreatConfidence),
	ThreatOriginalConfidence = ThreatOriginalConfidence,
	ThreatIsActive = tobool(ThreatIsActive),
	ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
	ThreatLastReportedTime = todatetime(ThreatLastReportedTime)