source
    | project
    AdditionalFields = todynamic(AdditionalFields),
    DhcpCircuitId = DhcpCircuitId,
    DhcpLeaseDuration = toint(DhcpLeaseDuration),
    DhcpSessionDuration = toint(DhcpSessionDuration),
    DhcpSessionId = DhcpSessionId,
    DhcpSrcDHCId = DhcpSrcDHCId,
    DhcpSubscriberId = DhcpSubscriberId,
    DhcpUserClass = DhcpUserClass,
    DhcpUserClassId = DhcpUserClassId,
    DhcpVendorClass = DhcpVendorClass,
    DhcpVendorClassId = DhcpVendorClassId,
    DvcAction = DvcAction,
    DvcDescription = DvcDescription,
    DvcDomain = DvcDomain,
    DvcDomainType = DvcDomainType,
    DvcFQDN = DvcFQDN,
    DvcHostname = DvcHostname,
    DvcId = DvcId,
    DvcIdType = DvcIdType,
    DvcInterface = DvcInterface,
    DvcIpAddr = DvcIpAddr,
    DvcMacAddr = DvcMacAddr,
    DvcOriginalAction = DvcOriginalAction,
    DvcOs = DvcOs,
    DvcOsVersion = DvcOsVersion,
    DvcScope = DvcScope,
    DvcScopeId = DvcScopeId,
    DvcZone = DvcZone,
    EventCount = toint(EventCount),
    EventEndTime = todatetime(EventEndTime),
    EventMessage = EventMessage,
    EventOriginalResultDetails = EventOriginalResultDetails,
    EventOriginalSeverity = EventOriginalSeverity,
    EventOriginalSubType = EventOriginalSubType,
    EventOriginalType = EventOriginalType,
    EventOriginalUid = EventOriginalUid,
    EventOwner = EventOwner,
    EventProduct = EventProduct,
    EventProductVersion = EventProductVersion,
    EventReportUrl = EventReportUrl,
    EventResult = EventResult,
    EventResultDetails = EventResultDetails,
    EventSchema = EventSchema,
    EventSchemaVersion = EventSchemaVersion,
    EventSeverity = EventSeverity,
    EventStartTime = todatetime(EventStartTime),
    EventSubType = EventSubType,
    EventType = EventType,
    EventVendor = EventVendor,
    RequestedIpAddr = RequestedIpAddr,
    SrcDescription = SrcDescription,
    SrcDeviceType = SrcDeviceType,
    SrcOriginalRiskLevel = SrcOriginalRiskLevel,
	SrcRiskLevel = toint(SrcRiskLevel),
	SrcGeoCountry = SrcGeoCountry,
	SrcGeoRegion = SrcGeoRegion,
	SrcGeoCity = SrcGeoCity,
	SrcGeoLatitude = todouble(SrcGeoLatitude),
	SrcGeoLongitude = todouble(SrcGeoLongitude),
    SrcDomain = SrcDomain,
    SrcDomainType = SrcDomainType,
    SrcDvcId = SrcDvcId,
    SrcDvcIdType = SrcDvcIdType,
    SrcDvcScope = SrcDvcScope,
    SrcDvcScopeId = SrcDvcScopeId,
    SrcFQDN = SrcFQDN,
    SrcHostname = SrcHostname,
    SrcIpAddr = SrcIpAddr,
    SrcMacAddr = SrcMacAddr,
    SrcOriginalUserType = SrcOriginalUserType,
    SrcPortNumber = toint(SrcPortNumber),
    SrcUserId = SrcUserId,
    SrcUserIdType = SrcUserIdType,
    SrcUsername = SrcUsername,
    SrcUsernameType = SrcUsernameType,
    SrcUserScope = SrcUserScope,
    SrcUserScopeId = SrcUserScopeId,
    SrcUserSessionId = SrcUserSessionId,
    SrcUserType = SrcUserType,
    SrcUserUid = SrcUserUid,
    TimeGenerated = TimeGenerated,
    RuleName = RuleName,
	RuleNumber = toint(RuleNumber),
	ThreatId = ThreatId,
	ThreatName = ThreatName,
	ThreatCategory = ThreatCategory,
	ThreatRiskLevel = toint(ThreatRiskLevel),
	ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
	ThreatField = ThreatField,
	ThreatConfidence = toint(ThreatConfidence),
	ThreatOriginalConfidence = ThreatOriginalConfidence,
	ThreatIsActive = tobool(ThreatIsActive),
	ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
	ThreatLastReportedTime = todatetime(ThreatLastReportedTime)