source
| project	
	TimeGenerated = TimeGenerated,
	EventMessage = EventMessage,
	EventCount = toint(EventCount),
	EventStartTime = todatetime(EventStartTime),
	EventEndTime = todatetime(EventEndTime),
	EventType = EventType,
	EventSubType = EventSubType,
	EventResult = EventResult,
	EventResultDetails = EventResultDetails,
	EventOriginalUid = EventOriginalUid,
	EventOriginalType = EventOriginalType,
	EventOriginalSubType = EventOriginalSubType,
	EventOriginalResultDetails = EventOriginalResultDetails,
	EventSeverity = EventSeverity,
	EventOriginalSeverity = EventOriginalSeverity,
	EventProduct = EventProduct,
	EventProductVersion = EventProductVersion,
	EventVendor = EventVendor,
	EventSchema = EventSchema,
	EventSchemaVersion = EventSchemaVersion,
	EventReportUrl = EventReportUrl,
	EventOwner = EventOwner,
	DvcIpAddr = DvcIpAddr,
	DvcHostname = DvcHostname,
	DvcDomain = DvcDomain,
	DvcDomainType = DvcDomainType,
	DvcFQDN = DvcFQDN,
	DvcDescription = DvcDescription,
	DvcId = DvcId,
	DvcIdType = DvcIdType,
	DvcMacAddr = DvcMacAddr,
	DvcZone = DvcZone,
	DvcOs = DvcOs,
	DvcOsVersion = DvcOsVersion,
	DvcAction = DvcAction,
	DvcOriginalAction = DvcOriginalAction,
	DvcInterface = DvcInterface,
	DvcScopeId = DvcScopeId,
	DvcScope = DvcScope,
	AdditionalFields = todynamic(AdditionalFields),
	TargetFileCreationTime = todatetime(TargetFileCreationTime),
	TargetFileDirectory = TargetFileDirectory,
	TargetFileExtension = TargetFileExtension,
	TargetFileMimeType = TargetFileMimeType,
	TargetFileName = TargetFileName,
	TargetFilePath = TargetFilePath,
	TargetFilePathType = TargetFilePathType,
	TargetFileMD5 = TargetFileMD5,
	TargetFileSHA1 = TargetFileSHA1,
	TargetFileSHA256 = TargetFileSHA256,
	TargetFileSHA512 = TargetFileSHA512,
	HashType = HashType,
	TargetFileSize = tolong(TargetFileSize),
	SrcFileCreationTime = todatetime(SrcFileCreationTime),
	SrcFileDirectory = SrcFileDirectory,
	SrcFileExtension = SrcFileExtension,
	SrcFileMimeType = SrcFileMimeType,
	SrcFileName = SrcFileName,
	SrcFilePath = SrcFilePath,
	SrcFilePathType = SrcFilePathType,
	SrcFileMD5 = SrcFileMD5,
	SrcFileSHA1 = SrcFileSHA1,
	SrcFileSHA256 = SrcFileSHA256,
	SrcFileSHA512 = SrcFileSHA512,
	SrcFileSize = tolong(SrcFileSize),
	SrcFQDN = SrcFQDN,
	ActorUserId = ActorUserId,
	ActorUserAadId = ActorUserAadId,
	ActorUserSid = ActorUserSid,
	ActorScope = ActorScope,
	ActorScopeId = ActorScopeId,
	ActorUserIdType = ActorUserIdType,
	ActorUsername = ActorUsername,
	ActorUsernameType = ActorUsernameType,
	ActorSessionId = ActorSessionId,
	ActorUserType = ActorUserType,
	ActorOriginalUserType = ActorOriginalUserType,
	ActingProcessCommandLine = ActingProcessCommandLine,
	ActingProcessName = ActingProcessName,
	ActingProcessId = ActingProcessId,
	ActingProcessGuid = ActingProcessGuid,
	HttpUserAgent = HttpUserAgent,
	NetworkApplicationProtocol = NetworkApplicationProtocol,
	SrcDescription = SrcDescription,
	SrcDeviceType= SrcDeviceType,
	SrcDomainType = SrcDomainType,
	SrcDvcId = SrcDvcId,
	SrcDvcIdType = SrcDvcIdType,
	SrcDvcScope = SrcDvcScope,
	SrcDvcScopeId = SrcDvcScopeId,
	SrcDomain = SrcDomain,
	SrcIpAddr = SrcIpAddr,
	SrcOriginalRiskLevel = SrcOriginalRiskLevel,
	SrcPortNumber = toint(SrcPortNumber),
	SrcRiskLevel = toint(SrcRiskLevel),
	SrcGeoCountry = SrcGeoCountry,
	SrcGeoRegion = SrcGeoRegion,
	SrcHostname = SrcHostname,
	SrcMacAddr = SrcMacAddr,
	SrcGeoCity = SrcGeoCity,
	SrcGeoLatitude = todouble(SrcGeoLatitude),
	SrcGeoLongitude = todouble(SrcGeoLongitude),
	TargetAppName = TargetAppName,
	TargetAppId = TargetAppId,
	TargetAppType = TargetAppType,
	TargetOriginalAppType = TargetOriginalAppType,
	TargetUrl = TargetUrl,
	RuleName = RuleName,
	RuleNumber = toint(RuleNumber),
	ThreatId = ThreatId,
	ThreatName = ThreatName,
	ThreatCategory = ThreatCategory,
	ThreatRiskLevel = toint(ThreatRiskLevel),
	ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
	ThreatFilePath = ThreatFilePath,
	ThreatField = ThreatField,
	ThreatConfidence = toint(ThreatConfidence),
	ThreatOriginalConfidence = ThreatOriginalConfidence,
	ThreatIsActive = tobool(ThreatIsActive),
	ThreatFirstReportedTime = todatetime(ThreatFirstReportedTime),
	ThreatLastReportedTime = todatetime(ThreatLastReportedTime)