source
| extend propertiesTable = properties
| project
    ActionType = tostring(propertiesTable["ActionType"]),
    AdditionalFields = todynamic(propertiesTable["AdditionalFields"]),
    AppGuardContainerId = tostring(propertiesTable["AppGuardContainerId"]),
    DeviceId = tostring(propertiesTable["DeviceId"]),
    DeviceName = tostring(propertiesTable["DeviceName"]),
    FileName = tostring(propertiesTable["FileName"]),
    FileOriginIP = tostring(propertiesTable["FileOriginIP"]),
    FileOriginReferrerUrl = tostring(propertiesTable["FileOriginReferrerUrl"]),
    FileOriginUrl = tostring(propertiesTable["FileOriginUrl"]),
    FileSize = tolong(propertiesTable["FileSize"]),
    FolderPath = tostring(propertiesTable["FolderPath"]),
    InitProcessAccountDomain = tostring(propertiesTable["InitiatingProcessAccountDomain"]),
    InitProcessAccountName = tostring(propertiesTable["InitiatingProcessAccountName"]),
    InitProcessAccountObjectId = tostring(propertiesTable["InitiatingProcessAccountObjectId"]),
    InitProcessAccountSid = tostring(propertiesTable["InitiatingProcessAccountSid"]),
    InitProcessAccountUpn = tostring(propertiesTable["InitiatingProcessAccountUpn"]),
    InitProcessCommandLine = tostring(propertiesTable["InitiatingProcessCommandLine"]),
    InitProcessFileName = tostring(propertiesTable["InitiatingProcessFileName"]),
    InitProcessFolderPath = tostring(propertiesTable["InitiatingProcessFolderPath"]),
    InitProcessId = tolong(propertiesTable["InitiatingProcessId"]),
    InitProcessIntegrityLevel = tostring(propertiesTable["InitiatingProcessIntegrityLevel"]),
    InitProcessMD5 = tostring(propertiesTable["InitiatingProcessMD5"]),
    InitProcessParentFileName = tostring(propertiesTable["InitiatingProcessParentFileName"]),
    InitProcessParentId = tolong(propertiesTable["InitiatingProcessParentId"]),
    InitProcessSHA1 = tostring(propertiesTable["InitiatingProcessSHA1"]),
    InitProcessSHA256 = tostring(propertiesTable["InitiatingProcessSHA256"]),
    InitProcessTokenElevation = tostring(propertiesTable["InitiatingProcessTokenElevation"]),
    InitProcessParentCreationTime = todatetime(propertiesTable["Test"]),
    InitProcessCreationTime = todatetime(propertiesTable["Test"]),
    IsAzureInfoProtectionApplied = tobool(propertiesTable["IsAzureInfoProtectionApplied"]),
    MD5 = tostring(propertiesTable["MD5"]),
    MachineGroup = tostring(propertiesTable["MachineGroup"]),
    PreviousFileName = tostring(propertiesTable["PreviousFileName"]),
    PreviousFolderPath = tostring(propertiesTable["PreviousFolderPath"]),
    ReportId = tolong(propertiesTable["ReportId"]),
    RequestAccountDomain = tostring(propertiesTable["RequestAccountDomain"]),
    RequestAccountName = tostring(propertiesTable["RequestAccountName"]),
    RequestAccountSid = tostring(propertiesTable["RequestAccountSid"]),
    RequestProtocol = tostring(propertiesTable["RequestProtocol"]),
    RequestSourceIP = tostring(propertiesTable["RequestSourceIP"]),
    RequestSourcePort = toint(propertiesTable["RequestSourcePort"]),
    SHA1 = tostring(propertiesTable["SHA1"]),
    SHA256 = tostring(propertiesTable["SHA256"]),
    SensitivityLabel = tostring(propertiesTable["SensitivityLabel"]),
    SensitivitySubLabel = tostring(propertiesTable["SensitivitySubLabel"]),
    ShareName = tostring(propertiesTable["ShareName"]),
    TimeGenerated = todatetime(propertiesTable["Timestamp"]),
    Timestamp = todatetime(propertiesTable["Timestamp"]),
    InitProcessFileSize = tolong(propertiesTable["InitiatingProcessFileSize"]),
    InitProcessVersionInfoCompanyName = tostring(propertiesTable["InitiatingProcessVersionInfoCompanyName"]),
    InitProcessVersionInfoFileDescription = tostring(propertiesTable["InitiatingProcessVersionInfoFileDescription"]),
    InitProcessVersionInfoInternalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoInternalFileName"]),
    InitProcessVersionInfoOriginalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoOriginalFileName"]),
    InitProcessVersionInfoProductName = tostring(propertiesTable["InitiatingProcessVersionInfoProductName"]),
    InitProcessVersionInfoProductVersion = tostring(propertiesTable["InitiatingProcessVersionInfoProductVersion"])