source
| extend propertiesTable = properties
| project
    AccountDomain = tostring(propertiesTable["AccountDomain"]),
    AccountName = tostring(propertiesTable["AccountName"]),
    AccountObjectId = tostring(propertiesTable["AccountObjectId"]),
    AccountSid = tostring(propertiesTable["AccountSid"]),
    AccountUpn = tostring(propertiesTable["AccountUpn"]),
    ActionType = tostring(propertiesTable["ActionType"]),
    AdditionalFields = todynamic(propertiesTable["AdditionalFields"]),
    AppGuardContainerId = tostring(propertiesTable["AppGuardContainerId"]),
    DeviceId = tostring(propertiesTable["DeviceId"]),
    DeviceName = tostring(propertiesTable["DeviceName"]),
    FileName = tostring(propertiesTable["FileName"]),
    FileSize = tolong(propertiesTable["FileSize"]),
    FolderPath = tostring(propertiesTable["FolderPath"]),
    InitiatingProcessAccountDomain = tostring(propertiesTable["InitiatingProcessAccountDomain"]),
    InitiatingProcessAccountName = tostring(propertiesTable["InitiatingProcessAccountName"]),
    InitiatingProcessAccountObjectId = tostring(propertiesTable["InitiatingProcessAccountObjectId"]),
    InitiatingProcessAccountSid = tostring(propertiesTable["InitiatingProcessAccountSid"]),
    InitiatingProcessAccountUpn = tostring(propertiesTable["InitiatingProcessAccountUpn"]),
    InitiatingProcessCommandLine = tostring(propertiesTable["InitiatingProcessCommandLine"]),
    InitiatingProcessCreationTime = todatetime(propertiesTable["InitiatingProcessCreationTime"]),
    InitiatingProcessFileName = tostring(propertiesTable["InitiatingProcessFileName"]),
    InitiatingProcessFolderPath = tostring(propertiesTable["InitiatingProcessFolderPath"]),
    InitiatingProcessId = tolong(propertiesTable["InitiatingProcessId"]),
    InitiatingProcessIntegrityLevel = tostring(propertiesTable["InitiatingProcessIntegrityLevel"]),
    InitiatingProcessLogonId = tolong(propertiesTable["InitiatingProcessLogonId"]),
    InitiatingProcessMD5 = tostring(propertiesTable["InitiatingProcessMD5"]),
    InitiatingProcessParentCreationTime = todatetime(propertiesTable["InitiatingProcessParentCreationTime"]),
    InitiatingProcessParentFileName = tostring(propertiesTable["InitiatingProcessParentFileName"]),
    InitiatingProcessParentId = tolong(propertiesTable["InitiatingProcessParentId"]),
    InitiatingProcessSHA1 = tostring(propertiesTable["InitiatingProcessSHA1"]),
    InitiatingProcessSHA256 = tostring(propertiesTable["InitiatingProcessSHA256"]),
    InitiatingProcessTokenElevation = tostring(propertiesTable["InitiatingProcessTokenElevation"]),
    InitiatingProcessFileSize = tolong(propertiesTable["InitiatingProcessFileSize"]),
    InitiatingProcessVersionInfoCompanyName = tostring(propertiesTable["InitiatingProcessVersionInfoCompanyName"]),
    InitiatingProcessVersionInfoProductName = tostring(propertiesTable["InitiatingProcessVersionInfoProductName"]),
    InitiatingProcessVersionInfoProductVersion = tostring(propertiesTable["InitiatingProcessVersionInfoProductVersion"]),
    InitiatingProcessVersionInfoInternalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoInternalFileName"]),
    InitiatingProcessVersionInfoOriginalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoOriginalFileName"]),
    InitiatingProcessVersionInfoFileDescription = tostring(propertiesTable["InitiatingProcessVersionInfoFileDescription"]),
    LogonId = tolong(propertiesTable["LogonId"]),
    MD5 = tostring(propertiesTable["MD5"]),
    MachineGroup = tostring(propertiesTable["MachineGroup"]),
    ProcessCommandLine = tostring(propertiesTable["ProcessCommandLine"]),
    ProcessCreationTime = todatetime(propertiesTable["ProcessCreationTime"]),
    ProcessId = tolong(propertiesTable["ProcessId"]),
    ProcessIntegrityLevel = tostring(propertiesTable["ProcessIntegrityLevel"]),
    ProcessTokenElevation = tostring(propertiesTable["ProcessTokenElevation"]),
    ProcessVersionInfoCompanyName = tostring(propertiesTable["ProcessVersionInfoCompanyName"]),
    ProcessVersionInfoProductName = tostring(propertiesTable["ProcessVersionInfoProductName"]),
    ProcessVersionInfoProductVersion = tostring(propertiesTable["ProcessVersionInfoProductVersion"]),
    ProcessVersionInfoInternalFileName = tostring(propertiesTable["ProcessVersionInfoInternalFileName"]),
    ProcessVersionInfoOriginalFileName = tostring(propertiesTable["ProcessVersionInfoOriginalFileName"]),
    ProcessVersionInfoFileDescription = tostring(propertiesTable["ProcessVersionInfoFileDescription"]),
    InitiatingProcessSignerType = tostring(propertiesTable["InitiatingProcessSignerType"]),
    InitiatingProcessSignatureStatus = tostring(propertiesTable["InitiatingProcessSignatureStatus"]),
    ReportId = tolong(propertiesTable["ReportId"]),
    SHA1 = tostring(propertiesTable["SHA1"]),
    SHA256 = tostring(propertiesTable["SHA256"]),
    TimeGenerated = todatetime(propertiesTable["Timestamp"]),
    Timestamp = todatetime(propertiesTable["Timestamp"]),
    TenantId = tostring(tenantId),
    CreatedProcessSessionId = tolong(propertiesTable["CreatedProcessSessionId"]),
    IsProcessRemoteSession = tobool(propertiesTable["IsProcessRemoteSession"]),
    ProcessRemoteSessionDeviceName = tostring(propertiesTable["ProcessRemoteSessionDeviceName"]),
    ProcessRemoteSessionIP = tostring(propertiesTable["ProcessRemoteSessionIP"]),
    InitiatingProcessSessionId = tolong(propertiesTable["InitiatingProcessSessionId"]),
    IsInitiatingProcessRemoteSession = tobool(propertiesTable["IsInitiatingProcessRemoteSession"]),
    InitiatingProcessRemoteSessionDeviceName = tostring(propertiesTable["InitiatingProcessRemoteSessionDeviceName"]),
    InitiatingProcessRemoteSessionIP = tostring(propertiesTable["InitiatingProcessRemoteSessionIP"]),
    InitiatingProcessUniqueId = tostring(propertiesTable["InitiatingProcessUniqueId"]),
    ProcessUniqueId = tostring(propertiesTable["ProcessUniqueId"])
