source
| extend propertiesTable = properties
| project
    AccountDomain = tostring(propertiesTable["AccountDomain"]),
    AccountName = tostring(propertiesTable["AccountName"]),
    AccountSid = tostring(propertiesTable["AccountSid"]),
    ActionType = tostring(propertiesTable["ActionType"]),
    AdditionalFields = todynamic(propertiesTable["AdditionalFields"]),
    AppGuardContainerId = tostring(propertiesTable["AppGuardContainerId"]),
    DeviceId = tostring(propertiesTable["DeviceId"]),
    DeviceName = tostring(propertiesTable["DeviceName"]),
    FileName = tostring(propertiesTable["FileName"]),
    FileOriginIP = tostring(propertiesTable["FileOriginIP"]),
    FileOriginUrl = tostring(propertiesTable["FileOriginUrl"]),
    FolderPath = tostring(propertiesTable["FolderPath"]),
    InitiatingProcessAccountDomain = tostring(propertiesTable["InitiatingProcessAccountDomain"]),
    InitiatingProcessAccountName = tostring(propertiesTable["InitiatingProcessAccountName"]),
    InitiatingProcessAccountObjectId = tostring(propertiesTable["InitiatingProcessAccountObjectId"]),
    InitiatingProcessAccountSid = tostring(propertiesTable["InitiatingProcessAccountSid"]),
    InitiatingProcessAccountUpn = tostring(propertiesTable["InitiatingProcessAccountUpn"]),
    InitiatingProcessCommandLine = tostring(propertiesTable["InitiatingProcessCommandLine"]),
    InitiatingProcessFileName = tostring(propertiesTable["InitiatingProcessFileName"]),
    InitiatingProcessFolderPath = tostring(propertiesTable["InitiatingProcessFolderPath"]),
    InitiatingProcessId = tolong(propertiesTable["InitiatingProcessId"]),
    InitiatingProcessLogonId = tolong(propertiesTable["InitiatingProcessLogonId"]),
    InitiatingProcessMD5 = tostring(propertiesTable["InitiatingProcessMD5"]),
    InitiatingProcessParentFileName = tostring(propertiesTable["InitiatingProcessParentFileName"]),
    InitiatingProcessParentId = tolong(propertiesTable["InitiatingProcessParentId"]),
    InitiatingProcessSHA1 = tostring(propertiesTable["InitiatingProcessSHA1"]),
    InitiatingProcessSHA256 = tostring(propertiesTable["InitiatingProcessSHA256"]),
    LocalIP = tostring(propertiesTable["LocalIP"]),
    LocalPort = toint(propertiesTable["LocalPort"]),
    LogonId = tolong(propertiesTable["LogonId"]),
    MD5 = tostring(propertiesTable["MD5"]),
    MachineGroup = tostring(propertiesTable["MachineGroup"]),
    ProcessCommandLine = tostring(propertiesTable["ProcessCommandLine"]),
    ProcessId = tolong(propertiesTable["ProcessId"]),
    ProcessTokenElevation = tostring(propertiesTable["ProcessTokenElevation"]),
    RegistryKey = tostring(propertiesTable["RegistryKey"]),
    RegistryValueData = tostring(propertiesTable["RegistryValueData"]),
    RegistryValueName = tostring(propertiesTable["RegistryValueName"]),
    RemoteDeviceName = tostring(propertiesTable["RemoteDeviceName"]),
    RemoteIP = tostring(propertiesTable["RemoteIP"]),
    RemotePort = toint(propertiesTable["RemotePort"]),
    RemoteUrl = tostring(propertiesTable["RemoteUrl"]),
    ReportId = tolong(propertiesTable["ReportId"]),
    SHA1 = tostring(propertiesTable["SHA1"]),
    SHA256 = tostring(propertiesTable["SHA256"]),
    TimeGenerated = todatetime(propertiesTable["Timestamp"]),
    Timestamp = todatetime(propertiesTable["Timestamp"]),
    FileSize = tolong(propertiesTable["FileSize"]),
    InitiatingProcessCreationTime = todatetime(propertiesTable["InitiatingProcessCreationTime"]),
    InitiatingProcessFileSize = tolong(propertiesTable["InitiatingProcessFileSize"]),
    InitiatingProcessParentCreationTime = todatetime(propertiesTable["InitiatingProcessParentCreationTime"]),
    InitiatingProcessVersionInfoCompanyName = tostring(propertiesTable["InitiatingProcessVersionInfoCompanyName"]),
    InitiatingProcessVersionInfoFileDescription = tostring(propertiesTable["InitiatingProcessVersionInfoFileDescription"]),
    InitiatingProcessVersionInfoInternalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoInternalFileName"]),
    InitiatingProcessVersionInfoOriginalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoOriginalFileName"]),
    InitiatingProcessVersionInfoProductName = tostring(propertiesTable["InitiatingProcessVersionInfoProductName"]),
    InitiatingProcessVersionInfoProductVersion = tostring(propertiesTable["InitiatingProcessVersionInfoProductVersion"]),
    ProcessCreationTime = todatetime(propertiesTable["ProcessCreationTime"]),
    CreatedProcessSessionId = tolong(propertiesTable["CreatedProcessSessionId"]),
    IsProcessRemoteSession = tobool(propertiesTable["IsProcessRemoteSession"]),
    ProcessRemoteSessionDeviceName = tostring(propertiesTable["ProcessRemoteSessionDeviceName"]),
    ProcessRemoteSessionIP = tostring(propertiesTable["ProcessRemoteSessionIP"]),
    InitiatingProcessSessionId = tolong(propertiesTable["InitiatingProcessSessionId"]),
    IsInitiatingProcessRemoteSession = tobool(propertiesTable["IsInitiatingProcessRemoteSession"]),
    InitiatingProcessRemoteSessionDeviceName = tostring(propertiesTable["InitiatingProcessRemoteSessionDeviceName"]),
    InitiatingProcessRemoteSessionIP = tostring(propertiesTable["InitiatingProcessRemoteSessionIP"]),
    InitiatingProcessUniqueId = tostring(propertiesTable["InitiatingProcessUniqueId"])