source
| extend propertiesTable = properties
| project
    ActionType = tostring(propertiesTable["ActionType"]),
    AppGuardContainerId = tostring(propertiesTable["AppGuardContainerId"]),
    DeviceId = tostring(propertiesTable["DeviceId"]),
    DeviceName = tostring(propertiesTable["DeviceName"]),
    FileName = tostring(propertiesTable["FileName"]),
    FolderPath = tostring(propertiesTable["FolderPath"]),
    InitiatingProcessAccountDomain = tostring(propertiesTable["InitiatingProcessAccountDomain"]),
    InitiatingProcessAccountName = tostring(propertiesTable["InitiatingProcessAccountName"]),
    InitiatingProcessAccountObjectId = tostring(propertiesTable["InitiatingProcessAccountObjectId"]),
    InitiatingProcessAccountSid = tostring(propertiesTable["InitiatingProcessAccountSid"]),
    InitiatingProcessAccountUpn = tostring(propertiesTable["InitiatingProcessAccountUpn"]),
    InitiatingProcessCommandLine = tostring(propertiesTable["InitiatingProcessCommandLine"]),
    InitiatingProcessFileName = tostring(propertiesTable["InitiatingProcessFileName"]),
    InitiatingProcessFolderPath = tostring(propertiesTable["InitiatingProcessFolderPath"]),
    InitiatingProcessId = tolong(propertiesTable["InitiatingProcessId"]),
    InitiatingProcessIntegrityLevel = tostring(propertiesTable["InitiatingProcessIntegrityLevel"]),
    InitiatingProcessMD5 = tostring(propertiesTable["InitiatingProcessMD5"]),
    InitiatingProcessParentFileName = tostring(propertiesTable["InitiatingProcessParentFileName"]),
    InitiatingProcessParentId = tolong(propertiesTable["InitiatingProcessParentId"]),
    InitiatingProcessSHA1 = tostring(propertiesTable["InitiatingProcessSHA1"]),
    InitiatingProcessSHA256 = tostring(propertiesTable["InitiatingProcessSHA256"]),
    InitiatingProcessTokenElevation = tostring(propertiesTable["InitiatingProcessTokenElevation"]),
    MD5 = tostring(propertiesTable["MD5"]),
    MachineGroup = tostring(propertiesTable["MachineGroup"]),
    ReportId = tolong(propertiesTable["ReportId"]),
    SHA1 = tostring(propertiesTable["SHA1"]),
    SHA256 = tostring(propertiesTable["SHA256"]),
    InitiatingProcessParentCreationTime = todatetime(propertiesTable["InitiatingProcessParentCreationTime"]),
    InitiatingProcessCreationTime = todatetime(propertiesTable["InitiatingProcessCreationTime"]),
    TimeGenerated = todatetime(propertiesTable["Timestamp"]),
    Timestamp = todatetime(propertiesTable["Timestamp"]),
    InitiatingProcessFileSize = tolong(propertiesTable["InitiatingProcessFileSize"]),
    InitiatingProcessVersionInfoCompanyName = tostring(propertiesTable["InitiatingProcessVersionInfoCompanyName"]),
    InitiatingProcessVersionInfoFileDescription = tostring(propertiesTable["InitiatingProcessVersionInfoFileDescription"]),
    InitiatingProcessVersionInfoInternalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoInternalFileName"]),
    InitiatingProcessVersionInfoOriginalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoOriginalFileName"]),
    InitiatingProcessVersionInfoProductName = tostring(propertiesTable["InitiatingProcessVersionInfoProductName"]),
    InitiatingProcessVersionInfoProductVersion = tostring(propertiesTable["InitiatingProcessVersionInfoProductVersion"]),
    FileSize = tolong(propertiesTable["FileSize"]),
    InitiatingProcessSessionId = tolong(propertiesTable["InitiatingProcessSessionId"]),
    IsInitiatingProcessRemoteSession = tobool(propertiesTable["IsInitiatingProcessRemoteSession"]),
    InitiatingProcessRemoteSessionDeviceName = tostring(propertiesTable["InitiatingProcessRemoteSessionDeviceName"]),
    InitiatingProcessRemoteSessionIP = tostring(propertiesTable["InitiatingProcessRemoteSessionIP"]),
    InitiatingProcessUniqueId = tostring(propertiesTable["InitiatingProcessUniqueId"])