source
    | project
        TimeGenerated =  TimeGenerated,
        EventCount = toint(EventCount),
        EventSchemaVersion = EventSchemaVersion,
        EventMessage = EventMessage,
        EventSeverity = EventSeverity,
        EventStartTime = todatetime(EventStartTime),
        EventEndTime = todatetime(EventEndTime),
        EventResultDetails = EventResultDetails,
        Dvc = Dvc,
        EventProductVersion = EventProductVersion,
        DvcOriginalAction = DvcOriginalAction,
        EventOriginalSeverity = EventOriginalSeverity,
        EventOriginalSubType = EventOriginalSubType,
        NetworkApplicationProtocol = NetworkApplicationProtocol,
        NetworkProtocolVersion = NetworkProtocolVersion,
        NetworkDirection = NetworkDirection,
        NetworkIcmpCode = toint(NetworkIcmpCode),
        NetworkIcmpType = NetworkIcmpType,
        NetworkConnectionHistory = NetworkConnectionHistory,
        DstBytes = DstBytes,
        SrcBytes = SrcBytes,
        NetworkBytes = NetworkBytes,
        DstPackets = DstPackets,
        SrcPackets = SrcPackets,
        NetworkPackets = NetworkPackets,
        NetworkSessionId = NetworkSessionId,
        DstGeoCountry = DstGeoCountry,
        DstGeoRegion = DstGeoRegion,
        DstGeoCity = DstGeoCity,
        DstGeoLatitude = todouble(DstGeoLatitude),
        DstGeoLongitude = todouble(DstGeoLongitude),
        DstUserId = DstUserId,
        DstUserIdType = DstUserIdType,
        DstUsername = DstUsername,
        DstUsernameType = DstUsernameType,
        DstUserType = DstUserType,
        DstOriginalUserType = DstOriginalUserType,
        DstAppName = DstAppId,
        DstAppId = DstAppId,
        DstAppType = DstAppType,
        SrcGeoCountry = SrcGeoCountry,
        SrcGeoRegion = SrcGeoRegion,
        SrcGeoCity = SrcGeoCity,
        SrcGeoLatitude = todouble(SrcGeoLatitude),
        SrcGeoLongitude = todouble(SrcGeoLongitude),
        SrcAppName = SrcAppName,
        SrcAppId = SrcAppId,
        SrcAppType = SrcAppType,
        DstNatIpAddr = DstNatIpAddr,
        DstNatPortNumber = toint(DstNatPortNumber),
        SrcNatIpAddr = SrcNatIpAddr,
        SrcNatPortNumber = toint(SrcNatPortNumber),
        ThreatId = ThreatId,
        ThreatName = ThreatName,
        ThreatCategory = ThreatCategory,
        ThreatRiskLevel = toint(ThreatRiskLevel),
        ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
        EventType = EventType,
        EventSubType = EventSubType,
        EventResult = EventResult,
        EventOriginalType = EventOriginalType,
        EventProduct = EventProduct,
        EventVendor = EventVendor,
        DvcIpAddr = DvcIpAddr,
        DvcHostname = DvcHostname,
        DvcDomain = DvcDomain,
        DvcDomainType = DvcDomainType,
        AdditionalFields = todynamic(AdditionalFields),
        SrcIpAddr = SrcIpAddr,
        SrcPortNumber = toint(SrcPortNumber),
        DstIpAddr = DstIpAddr,
        NetworkProtocol = NetworkProtocol,
        EventOriginalUid = EventOriginalUid,
        EventReportUrl = EventReportUrl,
        DvcFQDN = DvcFQDN,
        DvcId = DvcId,
        DvcIdType = DvcIdType,
        SrcHostname = SrcHostname,
        SrcDomain = SrcDomain,
        SrcDomainType = SrcDomainType,
        SrcFQDN = SrcFQDN,
        SrcDvcId = SrcDvcId,
        SrcDvcIdType = SrcDvcIdType,
        SrcDeviceType = SrcDeviceType,
        SrcUserId = SrcUserId,
        SrcUserIdType = SrcUserIdType,
        SrcUsername = SrcUsername,
        SrcUsernameType = SrcUsernameType,
        SrcUserType = SrcUserType,
        SrcOriginalUserType = SrcOriginalUserType,
        DstPortNumber = toint(DstPortNumber),
        DstHostname = DstHostname,
        DstDomain = DstDomain,
        DstDomainType = DstDomainType,
        DstFQDN = DstFQDN,
        DstDvcId = DstDvcId,
        DstDvcIdType = DstDvcIdType,
        DstDeviceType = DstDeviceType,
        DvcAction = DvcAction,
        ThreatIpAddr = ThreatIpAddr,
        ThreatField = ThreatField,
        ThreatIsActive = tobool(ThreatIsActive),
        ThreatConfidence = toint(ThreatConfidence),
        NetworkDuration = NetworkDuration,
        EventOriginalResultDetails = EventOriginalResultDetails,
        ThreatFirstReportedTime = ThreatFirstReportedTime,
        ThreatLastReportedTime = ThreatLastReportedTime,
        ThreatOriginalConfidence = ThreatOriginalConfidence,
        Rule = Rule,
        Url = Url,
        SrcMacAddr = SrcMacAddr,
        DstMacAddr = DstMacAddr,
        UrlCategory = UrlCategory,
        UrlOriginal = UrlOriginal,
        HttpVersion = HttpVersion,
        HttpRequestMethod = HttpRequestMethod,
        HttpContentType = HttpContentType,
        HttpContentFormat = HttpContentFormat,
        HttpReferrer = HttpReferrer,
        HttpUserAgent = HttpUserAgent,
        HttpRequestXff = HttpRequestXff,
        HttpRequestTime = HttpRequestTime,
        HttpResponseTime = HttpResponseTime,
        FileName = FileName,
        FileMD5 = FileMD5,
        FileSHA1 = FileSHA1,
        FileSHA256 = FileSHA256,
        FileSHA512 = FileSHA512,
        FileSize = FileSize,
        FileContentType = FileContentType,
        RuleName = RuleName,
        HttpHost = HttpHost,
        RuleNumber = toint(RuleNumber),
        EventOwner = EventOwner,
        SrcProcessName = SrcProcessName,
        SrcProcessId = SrcProcessId,
        SrcProcessGuid = SrcProcessGuid,
        SrcUserScope = SrcUserScope,
        SrcUserScopeId = SrcUserScopeId,
        SrcDvcScopeId = SrcDvcScopeId,
        SrcDvcScope = SrcDvcScope,
        DstDvcScopeId = DstDvcScopeId,
        DstDvcScope = DstDvcScope