source
| extend DstGeoLocation = geo_location(DstIpAddr)
| extend SrcGeoLocation = geo_location(SrcIpAddr)
| extend DnsResponseName = columnifexists("DnsResponseName","[]")
| extend ResponseIps = parse_json(DnsResponseName)
| extend ResponseGeoLocation = geo_location(ResponseIps[0])
| extend RequestIps = pack_array(SrcIpAddr,DstIpAddr)
| extend IpsArray = array_concat(ResponseIps,RequestIps)
| extend maliciousIpIndicator =  check_malicious_ip(IpsArray,true)
| extend ThreatIpAddr = tostring(maliciousIpIndicator["IP"])
| extend EventStartTime = columnifexists("EventStartTime", TimeGenerated)
| extend EventEndTime = columnifexists("EventEndTime", TimeGenerated)
| project 
    TimeGenerated = TimeGenerated,
    EventCount = toint(1),
    EventType = EventType,
    EventSubType = EventSubType,
    EventResult = EventResult,
    EventResultDetails = EventResultDetails,
    EventOriginalType = tostring(EventOriginalType),
    EventProduct = "DNS Server",
    EventVendor = "Microsoft",
    DvcIpAddr = DvcIpAddr,
    DvcHostname = DvcHostname,
    DvcDomain = DvcDomain,
    DvcDomainType = "FQDN",
    DvcOs = "Windows",
    DvcOsVersion = DvcOsVersion,
    AdditionalFields = todynamic(AdditionalFields),
    SrcIpAddr = SrcIpAddr,
    SrcPortNumber = toint(SrcPortNumber),
    SrcGeoCountry = tostring(SrcGeoLocation["Country"]),
    SrcGeoLatitude = tofloat(SrcGeoLocation["Latitude"]),
    SrcGeoLongitude = tofloat(SrcGeoLocation["Longitude"]),
    DstIpAddr = DstIpAddr,
    DstGeoCountry = tostring(DstGeoLocation["Country"]),
    DstGeoLatitude = tofloat(DstGeoLocation["Latitude"]),
    DstGeoLongitude = tofloat(DstGeoLocation["Longitude"]),
    DnsQuery = DnsQuery,
    DnsQueryType = toint(DnsQueryType),
    DnsQueryTypeName=  DnsQueryTypeName,
    DnsResponseCode = toint(DnsResponseCode),
    DnsResponseName = tostring(DnsResponseName),
    TransactionIdHex = TransactionIdHex,
    DnsResponseIpCountry = tostring(ResponseGeoLocation["Country"]),
    DnsResponseIpLatitude  = tofloat(ResponseGeoLocation["Latitude"]),
    DnsResponseIpLongitude = tofloat(ResponseGeoLocation["Longitude"]),
    NetworkProtocol = NetworkProtocol,
    DnsQueryClass = toint(1),
    DnsQueryClassName = "IN",
    DnsNetworkDuration = toint(DnsNetworkDuration),
    DnsFlags = DnsFlags,
    DnsFlagsAuthenticated = DnsFlagsAuthenticated,
    DnsFlagsAuthoritative = DnsFlagsAuthoritative,
    DnsFlagsRecursionDesired = DnsFlagsRecursionDesired,
    ThreatIpAddr,
    DnsSessionId = DnsSessionId,
    ThreatField = case(ThreatIpAddr == "", "",
                       ResponseIps contains ThreatIpAddr, "ResponseIpAddr",
                       ThreatIpAddr == DstIpAddr, "DstIpAddr",
                       ThreatIpAddr == SrcIpAddr, "SrcIpAddr",
                       ""),
    ThreatCategory = tostring(maliciousIpIndicator["ThreatType"]),
    ThreatName = tostring(maliciousIpIndicator["Description"]),
    ThreatOriginalConfidence =  tostring(maliciousIpIndicator["Confidence"]),
    ThreatConfidence = int(null),
    ThreatOriginalRiskLevel = toint(maliciousIpIndicator["Severity"]),
    ThreatOriginalRiskLevel_s = "",
    ThreatRiskLevel = int(null),
    ThreatIsActive  = tobool(maliciousIpIndicator["IsActive"]),
    EventReportUrl = tostring(maliciousIpIndicator["ReportReferenceLink"]),
    ThreatFirstReportedTime = tostring(maliciousIpIndicator["FirstReportedDateTime"]),
    ThreatFirstReportedTime_d = datetime(null),
    ThreatLastReportedTime = tostring(maliciousIpIndicator["LastReportedDateTime"]),
    ThreatLastReportedTime_d = datetime(null),
    EventEndTime = EventEndTime,
    EventSchemaVersion = "",
    EventStartTime = EventStartTime,
    DnsResponseIpCity = "",
    DnsResponseIpRegion = "",
    EventOwner = "",
    EventProductVersion = "",
    EventSeverity = "",
    DstDescription = "",
    DstDvcScope = "",
    DstDvcScopeId = "",
    DstOriginalRiskLevel = "",
    DstRiskLevel = int(null),
    DvcDescription = "",
    DvcInterface = "",
    DvcOriginalAction = "",
    DvcScope = "",
    DvcScopeId = "",
    EventOriginalSeverity = "",
    NetworkProtocolVersion = "",
    RuleName = "",
    RuleNumber = int(null),
    SrcDescription = "",
    SrcDvcScope = "",
    SrcDvcScopeId = "",
    SrcOriginalRiskLevel = "",
    SrcRiskLevel = int(null),
    SrcUserScope = "",
    SrcUserScopeId = "",
    SrcUserSessionId = "",
    ThreatId = "",
    EventMessage = "",
    EventOriginalUid ="",
    Dvc = "",
    DvcFQDN = "",
    DvcId = "",
    DvcIdType = "",
    DvcMacAddr ="",
    DvcZone = "",
    Src = "",
    SrcGeoRegion = "",
    SrcGeoCity ="",
    SrcHostname = "",
    SrcDomain = "",
    SrcDomainType = "",
    SrcFQDN = "",
    SrcDvcId = "",
    SrcDvcIdType = "",
    SrcDeviceType = "",
    SrcUserId = "",
    SrcUserIdType = "",
    SrcUsername = "",
    SrcUsernameType = "",
    SrcUserType = "",
    SrcOriginalUserType = "",
    SrcProcessName = "",
    SrcProcessId = "",
    SrcProcessGuid = "",
    Dst = "",
    DstPortNumber = int(null),
    DstGeoRegion= "",
    DstGeoCity="",
    DstHostname = "",
    DstDomain = "",
    DstDomainType = "",
    DstFQDN = "",
    DstDvcId = "",
    DstDvcIdType = "",
    DstDeviceType = "",
    UrlCategory = "",
    DvcAction = "",
    DnsFlagsCheckingDisabled = bool(null),
    DnsFlagsRecursionAvailable = DnsFlagsRecursionAvailable,
    DnsFlagsTruncated = DnsFlagsTruncated,
    DnsFlagsZ = bool(null)