source
    | project
        TimeGenerated =  TimeGenerated,
        EventCount = toint(EventCount),
        EventSchemaVersion = EventSchemaVersion,
        EventMessage = EventMessage,
        EventSeverity = EventSeverity,
        EventStartTime = todatetime(EventStartTime),
        EventEndTime = todatetime(EventEndTime),
        EventResultDetails = EventResultDetails,
        DvcMacAddr = DvcMacAddr,
        Dvc = Dvc,
        DvcZone = DvcZone,
        EventProductVersion = EventProductVersion,
        DvcOriginalAction = DvcOriginalAction,
        DvcInterface = DvcInterface,
        DvcSubscriptionId = DvcSubscriptionId,
        EventOriginalSeverity = EventOriginalSeverity,
        EventOriginalSubType = EventOriginalSubType,
        NetworkApplicationProtocol = NetworkApplicationProtocol,
        NetworkProtocolVersion = NetworkProtocolVersion,
        NetworkDirection = NetworkDirection,
        NetworkIcmpCode = toint(NetworkIcmpCode),
        NetworkIcmpType = NetworkIcmpType,
        NetworkConnectionHistory = NetworkConnectionHistory,
        DstBytes = tolong(DstBytes),
        SrcBytes = tolong(SrcBytes),
        NetworkBytes = tolong(NetworkBytes),
        DstPackets = tolong(DstPackets),
        SrcPackets = tolong(SrcPackets),
        NetworkPackets = tolong(NetworkPackets),
        NetworkSessionId = NetworkSessionId,
        DstZone = DstZone,
        DstInterfaceName = DstInterfaceName,
        DstInterfaceGuid = DstInterfaceGuid,
        DstMacAddr = DstMacAddr,
        DstVlanId = DstVlanId,
        DstSubscriptionId = DstSubscriptionId,
        DstGeoCountry = DstGeoCountry,
        DstGeoRegion = DstGeoRegion,
        DstGeoCity = DstGeoCity,
        DstGeoLatitude = todouble(DstGeoLatitude),
        DstGeoLongitude = todouble(DstGeoLongitude),
        DstUserId = DstUserId,
        DstUserIdType = DstUserIdType,
        DstUsername = DstUsername,
        DstUsernameType = DstUsernameType,
        DstUserType = DstUserType,
        DstOriginalUserType = DstOriginalUserType,
        DstAppName = DstAppId,
        DstAppId = DstAppId,
        DstAppType = DstAppType,
        SrcZone = SrcZone,
        SrcInterfaceName = SrcInterfaceName,
        SrcInterfaceGuid = SrcInterfaceGuid,
        SrcMacAddr = SrcMacAddr,
        SrcVlanId = SrcVlanId,
        SrcSubscriptionId = SrcSubscriptionId,
        SrcGeoCountry = SrcGeoCountry,
        SrcGeoRegion = SrcGeoRegion,
        SrcGeoCity = SrcGeoCity,
        SrcGeoLatitude = todouble(SrcGeoLatitude),
        SrcGeoLongitude = todouble(SrcGeoLongitude),
        SrcAppName = SrcAppName,
        SrcAppId = SrcAppId,
        SrcAppType = SrcAppType,
        DstNatIpAddr = DstNatIpAddr,
        DstNatPortNumber = toint(DstNatPortNumber),
        SrcNatIpAddr = SrcNatIpAddr,
        SrcNatPortNumber = toint(SrcNatPortNumber),
        DvcInboundInterface = DvcInboundInterface,
        DvcOutboundInterface = DvcOutboundInterface,
        NetworkRuleName = NetworkRuleName,
        NetworkRuleNumber = toint(NetworkRuleNumber),
        ThreatId = ThreatId,
        ThreatName = ThreatName,
        ThreatCategory = ThreatCategory,
        ThreatRiskLevel = toint(ThreatRiskLevel),
        ThreatOriginalRiskLevel = ThreatOriginalRiskLevel,
        EventType = EventType,
        EventSubType = EventSubType,
        EventResult = EventResult,
        EventOriginalType = EventOriginalType,
        EventProduct = EventProduct,
        EventVendor = EventVendor,
        DvcIpAddr = DvcIpAddr,
        DvcHostname = DvcHostname,
        DvcDomain = DvcDomain,
        DvcDomainType = DvcDomainType,
        DvcOs = DvcOs,
        DvcOsVersion = DvcOsVersion,
        AdditionalFields = todynamic(AdditionalFields),
        SrcIpAddr = SrcIpAddr,
        SrcPortNumber = toint(SrcPortNumber),
        DstIpAddr = DstIpAddr,
        NetworkProtocol = NetworkProtocol,
        EventOriginalUid = EventOriginalUid,
        EventReportUrl = EventReportUrl,
        DvcFQDN = DvcFQDN,
        DvcId = DvcId,
        DvcIdType = DvcIdType,
        SrcHostname = SrcHostname,
        SrcDomain = SrcDomain,
        SrcDomainType = SrcDomainType,
        SrcFQDN = SrcFQDN,
        SrcDvcId = SrcDvcId,
        SrcDvcIdType = SrcDvcIdType,
        SrcDeviceType = SrcDeviceType,
        SrcUserId = SrcUserId,
        SrcUserIdType = SrcUserIdType,
        SrcUsername = SrcUsername,
        SrcUsernameType = SrcUsernameType,
        SrcUserType = SrcUserType,
        SrcOriginalUserType = SrcOriginalUserType,
        DstPortNumber = toint(DstPortNumber),
        DstHostname = DstHostname,
        DstDomain = DstDomain,
        DstDomainType = DstDomainType,
        DstFQDN = DstFQDN,
        DstDvcId = DstDvcId,
        DstDvcIdType = DstDvcIdType,
        DstDeviceType = DstDeviceType,
        DvcAction = DvcAction,
        ThreatIpAddr = ThreatIpAddr,
        TcpFlagsAck = false,
        TcpFlagsFin = false,
        TcpFlagsPsh = false,
        TcpFlagsRst = false,
        TcpFlagsUrg = false,
        TcpFlagsSyn = false,
        ThreatField = "",
        ThreatIsActive = ThreatIsActive,
        ThreatConfidence = ThreatConfidence,
        NetworkDuration = NetworkDuration,
        DvcDescription = DvcDescription,
        EventOriginalResultDetails = EventOriginalResultDetails,
        ThreatFirstReportedTime = ThreatFirstReportedTime,
        ThreatLastReportedTime = ThreatLastReportedTime,
        ThreatOriginalConfidence = ThreatOriginalConfidence,
        DstDescription = DstDescription,
        SrcDescription = SrcDescription