source
| extend propertiesTable = properties
| project
    ActionType = tostring(propertiesTable["ActionType"]),
    AppGuardContainerId = tostring(propertiesTable["AppGuardContainerId"]),
    DeviceId = tostring(propertiesTable["DeviceId"]),
    DeviceName = tostring(propertiesTable["DeviceName"]),
    InitiatingProcessAccountDomain = tostring(propertiesTable["InitiatingProcessAccountDomain"]),
    InitiatingProcessAccountName = tostring(propertiesTable["InitiatingProcessAccountName"]),
    InitiatingProcessAccountObjectId = tostring(propertiesTable["InitiatingProcessAccountObjectId"]),
    InitiatingProcessAccountSid = tostring(propertiesTable["InitiatingProcessAccountSid"]),
    InitiatingProcessAccountUpn = tostring(propertiesTable["InitiatingProcessAccountUpn"]),
    InitiatingProcessCommandLine = tostring(propertiesTable["InitiatingProcessCommandLine"]),
    InitiatingProcessCreationTime = todatetime(propertiesTable["InitiatingProcessCreationTime"]),
    InitiatingProcessFileName = tostring(propertiesTable["InitiatingProcessFileName"]),
    InitiatingProcessFolderPath = tostring(propertiesTable["InitiatingProcessFolderPath"]),
    InitiatingProcessId = tolong(propertiesTable["InitiatingProcessId"]),
    InitiatingProcessIntegrityLevel = tostring(propertiesTable["InitiatingProcessIntegrityLevel"]),
    InitiatingProcessMD5 = tostring(propertiesTable["InitiatingProcessMD5"]),
    InitiatingProcessParentCreationTime = todatetime(propertiesTable["InitiatingProcessParentCreationTime"]),
    InitiatingProcessParentFileName = tostring(propertiesTable["InitiatingProcessParentFileName"]),
    InitiatingProcessParentId = tolong(propertiesTable["InitiatingProcessParentId"]),
    InitiatingProcessSHA1 = tostring(propertiesTable["InitiatingProcessSHA1"]),
    InitiatingProcessSHA256 = tostring(propertiesTable["InitiatingProcessSHA256"]),
    InitiatingProcessTokenElevation = tostring(propertiesTable["InitiatingProcessTokenElevation"]),
    InitiatingProcessFileSize = tolong(propertiesTable["InitiatingProcessFileSize"]),
    InitiatingProcessVersionInfoCompanyName = tostring(propertiesTable["InitiatingProcessVersionInfoCompanyName"]),
    InitiatingProcessVersionInfoProductName = tostring(propertiesTable["InitiatingProcessVersionInfoProductName"]),
    InitiatingProcessVersionInfoProductVersion = tostring(propertiesTable["InitiatingProcessVersionInfoProductVersion"]),
    InitiatingProcessVersionInfoInternalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoInternalFileName"]),
    InitiatingProcessVersionInfoOriginalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoOriginalFileName"]),
    InitiatingProcessVersionInfoFileDescription = tostring(propertiesTable["InitiatingProcessVersionInfoFileDescription"]),
    MachineGroup = tostring(propertiesTable["MachineGroup"]),
    PreviousRegistryKey = tostring(propertiesTable["PreviousRegistryKey"]),
    PreviousRegistryValueData = tostring(propertiesTable["PreviousRegistryValueData"]),
    PreviousRegistryValueName = tostring(propertiesTable["PreviousRegistryValueName"]),
    RegistryKey = tostring(propertiesTable["RegistryKey"]),
    RegistryValueData = tostring(propertiesTable["RegistryValueData"]),
    RegistryValueName = tostring(propertiesTable["RegistryValueName"]),
    RegistryValueType = tostring(propertiesTable["RegistryValueType"]),
    ReportId = tolong(propertiesTable["ReportId"]),
    TimeGenerated = todatetime(propertiesTable["Timestamp"]),
    Timestamp = todatetime(propertiesTable["Timestamp"]),
    InitiatingProcessSessionId = tolong(propertiesTable["InitiatingProcessSessionId"]),
    IsInitiatingProcessRemoteSession = tobool(propertiesTable["IsInitiatingProcessRemoteSession"]),
    InitiatingProcessRemoteSessionDeviceName = tostring(propertiesTable["InitiatingProcessRemoteSessionDeviceName"]),
    InitiatingProcessRemoteSessionIP = tostring(propertiesTable["InitiatingProcessRemoteSessionIP"]),
    RuleName = tostring(propertiesTable["RuleName"]),
    RuleLastModificationTime = todatetime(propertiesTable["RuleLastModificationTime"])