source
| extend propertiesTable = properties
| project
    ActionType = tostring(propertiesTable["ActionType"]),
    DeviceId = tostring(propertiesTable["DeviceId"]),
    DeviceName = tostring(propertiesTable["DeviceName"]),
    ReportId = tolong(propertiesTable["ReportId"]),
    Timestamp = todatetime(propertiesTable["Timestamp"]),
    TimeGenerated = todatetime(propertiesTable["Timestamp"]),
    InitiatingProcessId = tolong(propertiesTable["InitiatingProcessId"]),
    InitiatingProcessCreationTime = todatetime(propertiesTable["InitiatingProcessCreationTime"]),
    InitiatingProcessCommandLine = tostring(propertiesTable["InitiatingProcessCommandLine"]),
    InitiatingProcessParentFileName = tostring(propertiesTable["InitiatingProcessParentFileName"]),
    InitiatingProcessParentId = tolong(propertiesTable["InitiatingProcessParentId"]),
    InitiatingProcessParentCreationTime = todatetime(propertiesTable["InitiatingProcessParentCreationTime"]),
    InitiatingProcessSHA1 = tostring(propertiesTable["InitiatingProcessSHA1"]),
    InitiatingProcessSHA256 = tostring(propertiesTable["InitiatingProcessSHA256"]),
    InitiatingProcessMD5 = tostring(propertiesTable["InitiatingProcessMD5"]),
    InitiatingProcessFileName = tostring(propertiesTable["InitiatingProcessFileName"]),
    InitiatingProcessFolderPath = tostring(propertiesTable["InitiatingProcessFolderPath"]),
    InitiatingProcessAccountName = tostring(propertiesTable["InitiatingProcessAccountName"]),
    InitiatingProcessAccountDomain = tostring(propertiesTable["InitiatingProcessAccountDomain"]),
    InitiatingProcessSignatureStatus = tostring(propertiesTable["InitiatingProcessSignatureStatus"]),
    InitiatingProcessSignerType = tostring(propertiesTable["InitiatingProcessSignerType"]),
    InitiatingProcessAccountSid = tostring(propertiesTable["InitiatingProcessAccountSid"]),
    InitiatingProcessAccountUpn = tostring(propertiesTable["InitiatingProcessAccountUpn"]),
    InitiatingProcessAccountObjectId = tostring(propertiesTable["InitiatingProcessAccountObjectId"]),
    InitiatingProcessFileSize = tolong(propertiesTable["InitiatingProcessFileSize"]),
    InitiatingProcessVersionInfoCompanyName = tostring(propertiesTable["InitiatingProcessVersionInfoCompanyName"]),
    InitiatingProcessVersionInfoProductName = tostring(propertiesTable["InitiatingProcessVersionInfoProductName"]),
    InitiatingProcessVersionInfoProductVersion = tostring(propertiesTable["InitiatingProcessVersionInfoProductVersion"]),
    InitiatingProcessVersionInfoInternalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoInternalFileName"]),
    InitiatingProcessVersionInfoOriginalFileName = tostring(propertiesTable["InitiatingProcessVersionInfoOriginalFileName"]),
    InitiatingProcessVersionInfoFileDescription = tostring(propertiesTable["InitiatingProcessVersionInfoFileDescription"]),
    ScriptContent = tostring(propertiesTable["ScriptContent"]),
    ScriptContentSHA256 = tostring(propertiesTable["ScriptContentSHA256"]),
    RuleName = tostring(propertiesTable["RuleName"]),
    RuleLastModificationTime = todatetime(propertiesTable["RuleLastModificationTime"])