[
  {
    "Id": "92b8317e-c2eb-4505-9d83-82ce66495feb",
    "WorkspaceId": "90c861db-fbdf-484c-9cc7-814acde59e35",
    "VendorName": "Microsoft",
    "TimeGenerated": "2018-10-24T02:23:45.000Z",
    "AnomalyTemplateId": "393e8aab-ec03-469a-9529-dc9a508bf3c7",
    "AnomalyTemplateName": "Anomalous Login Detection",
    "AnomalyTemplateVersion": "1.0.0",
    "RuleId": "7fedc954-c427-48e3-8996-92900ae33c2c",
    "RuleStatus": "Production",
    "RuleName": "Anomalous Login Detection",
    "RuleConfigVersion": "1.0.0",
    "Score": 0.8,
    "Description": "Unusual number of failed logins from expired user account.",
    "StartTime": "2018-10-24T02:23:45.000Z",
    "EndTime": "2018-10-24T02:23:45.000Z",
    "ExtendedLinks": "[{\"Type\":\"bladeLink\", \"Extension\":\"Sentinel\", \"BladeType\":\"Logs\", \"DetailBladeInputs\":\"CommonSecurityLog | where _ItemId in ('36050153-a066-11ea-a80e-000d3af3ad7c', '36050154-a066-11ea-a80e-000d3af3ad7c')\"}]",
    "Tactics": "[ \"People Information Gathering\" ]",
    "Techniques": "[ \"Acquire and/or use 3rd party infrastructure services\" ]",
    "UserName": "jdoe",
    "UserPrincipalName": "jdoe@microsoft.com",
    "SourceIpAddress": "103.238.224.182",
    "SourceLocation": "{\"State\": \"Washington\", \"City\": \"Seattle\"}",
    "SourceDevice": "",
    "DestinationIpAddress": "1.1.1.1",
    "DestinationLocation": "{\"State\": \"Washington\"}",
    "DestinationDevice": "",
    "ActivityInsights": "[{\"FirstTimeUserConnectedFromGeo\" : \"true\", \"PeersConnectedFromGeo\" : \"false\", \"IsGroupSensitive\": \"true\", \"MemberAdded\": \"Danny@microsoft.com\"}]",
    "DeviceInsights": "[{\"SourceDeviceAADJoined\" : \"true\", \"SourceDeviceIntuneManaged\" : \"true\"}]",
    "UserInsights": "[{\"AccountDisplayName\" : \"jdoe\", \"AccountDomain\" : \"Middleeast\", \"AccountObjectId\" : \"12323-123345-123123-345345\", \"BlastRadius\" : \"low\"}]",
    "AnomalyReasons": "[{\"Name\" : \"Sensitivity change\", \"Value\" : \"Highly Confidential -> General\", \"TypicalObservations\" : {\"Highly Confidential -> Confidential\": \"86.7%\", \"General -> Business\": \"33.0%\", \"Highly confidential -> General\": \"0.3%\"}}]",
    "Entities": "[{\"Type\": \"account\", \"Name\": \"John Doe\", \"NTDomain\": \"middleeast\",\"DnsDomain\": \"middleeast.corp.microsoft.com\",\"UPNSuffix\": \"microsoft.com\",\"Sid\": \"S-1-5-18\"},{\"Type\": \"network-connection\",\"SourceAddress\": {\"Type\": \"ip\",\"Address\": \"103.238.224.182\", \"GeoLocation\": {\"State\": \"Washington\", \"City\": \"Seattle\"}},\"DestinationAddress\": {\"Type\": \"ip\", \"Address\": \"1.1.1.1\",\"GeoLocation\": {\"State\": \"Washington\"}}]",
    "ExtendedProperties": "{\"RuleId\":\"7fedc954-c427-48e3-8996-92900ae33c2c\", \"RuleName\":\"Anomalous Login Detection\", \"RuleStatus\":\"Production\", \"RuleConfigVersion\":\"1.0.0\", \"ActivityInsights\":\"[{\"FirstTimeUserConnectedFromGeo\" : \"true\", \"PeersConnectedFromGeo\" : \"false\", \"IsGroupSensitive\": \"true\", \"MemberAdded\": \"Danny@microsoft.com\"}]\", \"DeviceInsights\":\"[{\"SourceDeviceAADJoined\" : \"true\", \"SourceDeviceIntuneManaged\" : \"true\"}]\", \"UserInsights\":\"[{\"AccountDisplayName\" : \"jdoe\", \"AccountDomain\" : \"Middleeast\", \"AccountObjectId\" : \"12323-123345-123123-345345\", \"BlastRadius\" : \"low\"}]\"}",
    "AnomalyDetails": "{ \"TemplateId\": \"393e8aab-ec03-469a-9529-dc9a508bf3c7\", \"TemplateName\": \"Anomalous Login Detection\",\"AlgorithmName\": \"BruteForce\",\"TemplateVersion\": \"1.0.0\",\"Observable\": [{\"Name\" : \"Sensitivity change\", \"Value\" : \"Highly Confidential -> General\", \"TypicalObservations\" : {\"Highly Confidential -> Confidential\": \"86.7%\", \"General -> Business\": \"33.0%\", \"Highly confidential -> General\": \"0.3%\"}}],\"Score\": \"0.8\"}"
  }
]
